perf/basic_scenario_timeout.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    node_replicated:
      target: 'http://localhost:5555/node_replicated'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node_replicated"


  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - 
      name: Ramp - warm up
      duration: 30
      arrivalRate: 5
      rampTo: 15
    - 
      name: Plain - cantidad fija requests
      duration: 30
      arrivalRate: 15
    -
      name: Ramp - más violenta
      duration: 30
      arrivalRate: 15
      rampTo: 50
    -
      name: Plain - más violenta
      duration: 30
      arrivalRate: 50
    -
      # Ramp down
      arrivalRate: 28
      duration: 1.96
    -
      arrivalRate: 26
      duration: 1.96
    -
      arrivalRate: 24
      duration: 1.96
    -
      arrivalRate: 22
      duration: 1.96
    -
      arrivalRate: 20
      duration: 1.96
    -
      arrivalRate: 18
      duration: 1.96
    -
      arrivalRate: 16
      duration: 1.96
    -
      arrivalRate: 14
      duration: 1.96
    -
      arrivalRate: 12
      duration: 1.96
    -
      arrivalRate: 10
      duration: 1.96
    -
      arrivalRate: 8
      duration: 1.96
    -
      arrivalRate: 6
      duration: 1.96
    -
      arrivalRate: 4
      duration: 1.96
    -
      arrivalRate: 2
      duration: 1.96
    -
      arrivalRate: 0.1
      duration: 30


scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/timeout'